// --створити масив з:

//     - з 5 числових значень
// let numbers = [];
// for (let i = 0; i < 5; i++) {
//     numbers[i] = i;
// }
// console.log(numbers);

// - з 5 стічкових значень
// let string = [];
// for(let i=0;i<5;i++){
// string[i]='dsadsfdasf' +' '+ `${i}`
// }
// console.log(string)

// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль
// let complex = [];
// for (let i = 0; i < 15; i++) {
//     if (i === 0 || i > 0 && i < 5) {
//         complex[i] = "xsdfs";
//     } else if (i > 4 && i <= 9) {
//         complex[i] = i;
//     } else if (i > 9 && i < 15) {
//         if (i % 2) {
//             complex[i] = true;
//         } else {
//             complex[i] = false;
//         }
//     }
// }
// console.log(complex);

// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
// let random = [];
//
// random[2]='ababagalamaga';
// random[5]=[1,3,4,5,7];
// random[6]=false;
// random[8]=true;
//
// console.log(random)

//
// - є масив [2,17,13,6,22,31,45,66,100,-18] :
let numbers = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// 1. перебрати його циклом while
// let i =0;
// while (i<numbers.length){
//     console.log(numbers[i]);
//     i++
// }

// 2. перебрати його циклом for
// for (const number of numbers) {
//     console.log(number)
// }

// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
// let i = 0;
// while (i<numbers.length){
//     if (i===0 || i%2 !==0){
//         console.log(numbers[i])
//     }
//     i++
// }

// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// for (let i = 0; i < numbers.length; i++) {
//     if (i===0 || i%2 !==0){
//         console.log(numbers[i])
//     }
// }

// 5. перебрати циклом while та вивести  числа тільки парні  значення
// let i = 0;
// while (i < numbers.length) {
//     if (numbers[i] % 2 === 0) {
//         console.log(numbers[i]);
//     }
//     i++
// }

// 6. перебрати циклом for та вивести  числа тільки парні  значення
// for(let i=0;i<numbers.length;i++){
//     if (numbers[i] % 2 === 0) {
//         console.log(numbers[i]);
//     }
// }

// 7. замінити кожне число кратне 3 на слово "okten"
// for(let i=0;i<numbers.length;i++){
// if (numbers[i]%3===0){
//     numbers[i]="okten";
// }
// }
// console.log( numbers)

// 8. вивести масив в зворотньому порядку.
// let numbersTwo = [];
// for (let i = 0; i < numbers.length; i++) {
//     for (let j = numbers.length - 1; j >= 0; j--) {
//         numbersTwo[i++] = numbers[j];
//         console.log(numbersTwo);
//     }
//
//або
// for (let i = numbers.length - 1; i >= 0; i--) {
//     const number = numbers[i];
//     console.log(number);
// }


// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)

//1.
// let i = numbers.length - 1;
// while (i >= 0){
//     console.log(numbers[i]);
//     i--
// }

//2.
// for (let i = numbers.length - 1; i >= 0; i--) {
//     console.log(numbers[i]);
// }

//3.
// let i = numbers.length - 1;
// while (i >= 0){
//     if (i===0 || i%2 !==0){
//         console.log(numbers[i])
//     }
//     i--
// }

//4.
// for (let i = numbers.length - 1; i >= 0; i--) {
//     if (i===0 || i%2 !==0){
//         console.log(numbers[i])
//     }
// }



// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
//
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
//
//
//
// стоврити масив книжок (назва, кількість сторінок, автори , жанри).
// -знайти наібльшу книжку.
// - знайти книжку/ки з найбільшою кількістю жанрів
// - знайти книжку/ки з найдовшою назвою
// - знайти книжку/ки які писали 2 автори
// - знайти книжку/ки які писав 1 автор